#### Terragrunt Plan 📖 (infra/dev/path1) `success`

<details><summary>Show Plan</summary>

```
06:53:28.581 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
06:53:28.582 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
06:53:28.582 STDOUT tofu:   + create
06:53:28.582 STDOUT tofu: OpenTofu will perform the following actions:
06:53:28.582 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
06:53:28.582 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
06:53:28.582 STDOUT tofu:       + effective_labels            = {
06:53:28.582 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
06:53:28.582 STDOUT tofu:         }
06:53:28.582 STDOUT tofu:       + force_destroy               = true
06:53:28.582 STDOUT tofu:       + id                          = (known after apply)
06:53:28.582 STDOUT tofu:       + location                    = "US"
06:53:28.582 STDOUT tofu:       + name                        = "thr-sfno-publisdfgtgc-accgess-dbucket"
06:53:28.582 STDOUT tofu:       + project                     = "psyched-circuit-405312"
06:53:28.582 STDOUT tofu:       + project_number              = (known after apply)
06:53:28.582 STDOUT tofu:       + public_access_prevention    = "enforced"
06:53:28.582 STDOUT tofu:       + rpo                         = (known after apply)
06:53:28.582 STDOUT tofu:       + self_link                   = (known after apply)
06:53:28.582 STDOUT tofu:       + storage_class               = "STANDARD"
06:53:28.582 STDOUT tofu:       + terraform_labels            = {
06:53:28.582 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
06:53:28.583 STDOUT tofu:         }
06:53:28.583 STDOUT tofu:       + time_created                = (known after apply)
06:53:28.583 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
06:53:28.583 STDOUT tofu:       + updated                     = (known after apply)
06:53:28.583 STDOUT tofu:       + url                         = (known after apply)
06:53:28.583 STDOUT tofu:       + soft_delete_policy (known after apply)
06:53:28.583 STDOUT tofu:       + versioning (known after apply)
06:53:28.583 STDOUT tofu:       + website (known after apply)
06:53:28.583 STDOUT tofu:     }
06:53:28.583 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
06:53:28.583 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
06:53:28.583 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
06:53:28.583 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/dev/path1`*